omarabedk/CM33/lpc55s69_calc_starter_master/source/sysdep.c
void cursor_on_cb (void)
/* switch cursor on */
{
	/* A COMPLETER */
}

void cursor_off_cb (void)
/* switch cursor off */
{
	/* A COMPLETER */
}

void clear_eol (void)
/* clear the text line from cursor position */
{
	/* A COMPLETER */
}

void edit_off_cb (void)
/* the command line is no longer in use (graphics or computing) */
{
}

void edit_on_cb (void)
/* the command line is active */
{
}

void page_up_cb(void)
{
}

void page_down_cb()
{
}
/***************** clock and wait ********************/
volatile uint32_t sys_tick_cnt=0;

/* sys_tick timer IRQ Handler
 *    limit sys_tick_cnt to 23 bits
 */
void SysTick_Handler(void)
{

}

real sys_clock (void)
/***** define a timer in seconds.
******/
{
	return 0.0;
}

void sys_wait (real time, scan_t *scan)
/***** Wait for time seconds or until a key press.
Return the scan code or 0 (time exceeded).
******/
{
	if (user_break) {		// a key was pressed, so stop and quit
		char c;
		c=uart_getc(USART0); *scan=escape;
		return;
	}
}

/*******************************************************************************
 * FILE INPUT/OUTPUT ROUTINES (SDCARD)
 ******************************************************************************/
static bool card_ready = false;
sd_card_t card;
static FATFS fs;

char cur_path[64]="";

status_t sd_init(sd_card_t *card, sd_cd_t detectCb, void *userData)
{
	SDK_ALIGN(static uint32_t s_sdmmcHostDmaBuffer[64], SDMMCHOST_DMA_DESCRIPTOR_BUFFER_ALIGN_SIZE);
	static sd_detect_card_t s_cd;
	static sdmmchost_t s_host;
	
	/* attach main clock to SDIF */
	CLOCK_AttachClk(kMAIN_CLK_to_SDIO_CLK);
	/* need call this function to clear the halt bit in clock divider register */
	CLOCK_SetClkDiv(kCLOCK_DivSdioClk, (uint32_t)(SystemCoreClock / FSL_FEATURE_SDIF_MAX_SOURCE_CLOCK + 1U), true);
	
	memset(card, 0U, sizeof(sd_card_t));
	card->host = &s_host;
	card->host->dmaDesBuffer					= s_sdmmcHostDmaBuffer;
	card->host->dmaDesBufferWordsNum			= 64;
	card->host->hostController.base				= SDIF;
	card->host->hostController.sourceClock_Hz	= CLOCK_GetSdioClkFreq();
	
	/* install card detect callback */
	s_cd.cdDebounce_ms	= 100u;
	s_cd.type			= kSD_DetectCardByHostCD;
	s_cd.callback		= detectCb;
	s_cd.userData		= userData;
	card->usrParam.cd	= &s_cd;
	
	NVIC_SetPriority(SDIO_IRQn, 5);
	
	return SD_HostInit(card);
}

static void sd_info(sd_card_t *card)
{
    assert(card);

    outputf(calc,"\nCard size %d * %d bytes\n", card->blockCount, card->blockSize);
    outputf(calc,"Working condition:\n");
    if (card->operationVoltage==kSDMMC_OperationVoltage330V) {
        outputf(calc,"  Voltage : 3.3V\n");
    } else if (card->operationVoltage==kSDMMC_OperationVoltage180V) {
        outputf(calc,"  Voltage : 1.8V\n");
    }

    if (card->currentTiming == kSD_TimingSDR12DefaultMode) {
        if (card->operationVoltage==kSDMMC_OperationVoltage330V) {
            outputf(calc,"  Timing mode: Default mode\n");
        } else if (card->operationVoltage==kSDMMC_OperationVoltage180V) {
            outputf(calc,"  Timing mode: SDR12 mode\n");
        }
    } else if (card->currentTiming==kSD_TimingSDR25HighSpeedMode) {
        if (card->operationVoltage==kSDMMC_OperationVoltage180V) {
            outputf(calc,"  Timing mode: SDR25\n");
        } else {
            outputf(calc,"  Timing mode: High Speed\n");
        }
    } else if (card->currentTiming==kSD_TimingSDR50Mode) {
        outputf(calc,"  Timing mode: SDR50\n");
    } else if (card->currentTiming==kSD_TimingSDR104Mode) {
        outputf(calc,"  Timing mode: SDR104\n");
    } else if (card->currentTiming==kSD_TimingDDR50Mode) {
        outputf(calc,"  Timing mode: DDR50\n");
    }

    outputf(calc,"\r\n  Freq : %d HZ\r\n",card->busClock_Hz);
}

/* card_detect_cb
 *   card detection callback, called from the SDIO card detection ISR
 */
static void card_detect_cb(bool isInserted, void *userData)
{
    updateFS=true;
}

/* update_sd_state
 *   initialize SD card, mount/unmount the filesystem
 */
static void update_sd_state()
{
	FRESULT res;
	const TCHAR driverNumberBuffer[3U] = {SDDISK + '0', ':', '/'};

	if (!card_ready) {
		/* Init card. */
		SD_CardInit(&card);
//		sd_info(&card);
		/* mount file system */
//		res=f_mount( A COMPLETER );
		if (res!=FR_OK) return;
		/* select the drive */
//		res=f_chdrive( A COMPLETER );
		if (res!=FR_OK) return;
		/* get the current root path */
//		res=f_getcwd( A COMPLETER );
		if (res!=FR_OK) return;
		card_ready=true;
	} else {
		card_ready=false;
		/* unmount file system */
//		f_mount( A COMPLETER );
	}
}

/* search path list:
 *   path[0]       --> current directory
 */
char *path[MAX_PATH]={cur_path};
int npath=1;


/*
 *	scan a directory and get :
 *		files : an array of entries matching the pattern
 *		files_count : number of files entries
 *	the function returns the max length of a file entry
 */
static int match (char *pat, char *s)
{	if (*pat==0) return *s==0;
	if (*pat=='*') {
		pat++;
		if (!*pat) return 1;
		while (*s) {
			if (match(pat,s)) return 1;
			s++;
		}
		return 0;
	}
	if (*s==0) return 0;
	if (*pat=='?') return match(pat+1,s+1);
	if (*pat!=*s) return 0;
	return match(pat+1,s+1);
}

static int entry_cmp(const char**e1, char**e2)
{
	return strcmp(*e1,*e2);
}

/* fs_dir --> ls command
 *   list the files from the directory *dir_name* corresponding to pattern *pat*
 *   returns an array of all the *files_count* names in the *files* array
 */
int fs_dir(char *dir_name, char *pat, char ** files[], int *files_count)
{
	FRESULT res;
	DIR dir;
	FILINFO f;
	int entry_count=0, len=0;
	char **buf = NULL, **tmp;

	if (!card_ready) return 0;

	res=f_opendir(&dir, dir_name);
    if (res == FR_OK) {
        for (;;) {
            res = f_readdir(&dir, &f);                   /* Read a directory item */
            if (res != FR_OK || f.fname[0] == 0) break;  /* Break on error or end of dir */
			if (match(pat,f.fname)) {
//				if (strcmp(f.fname,".")==0 || strcmp(f.fname,"..")==0)
//					continue;
				int isdir=f.fattrib & AM_DIR;            /* is it a directory? */
				int l=strlen(f.fname);
				len = len>l ? len : l;
				tmp = (char**)realloc(buf,(entry_count+1)*sizeof(char *));
				if (tmp) {
					buf=tmp;
					buf[entry_count]=(char*)malloc(isdir ? l+2 : l+1);
					if (buf[entry_count]) {
						strcpy(buf[entry_count],f.fname);
						if (isdir) {
							strcat(buf[entry_count],"/");
						}
						entry_count++;
					} else break;
				} else break;
			}
		}

		f_closedir(&dir);

		if (buf)
			qsort(buf,entry_count,sizeof(char*),(int (*)(const void*, const void*))entry_cmp);
	}

	*files = buf;
	*files_count = entry_count;

	return len;
}

/* fs_cd --> cd command
 *   sets the path if dir!=0 and returns the path
 *   else returns the current path
 */
char *fs_cd (char *dir)
{
	/* A COMPLETER */

	return path[0];
}

