omarabedk/CM33/lpc55s69_calc_starter_master/source/sysdep.c
/* Drawing context management functions */
void lcd_get_default_DC(DC *dc)
{

}

const Font* lcd_set_font(DC *dc, const Font *font)
{
	uintptr_t font_address = (uintptr_t)font;
	while (!mb_push_evt(EVT_SETFONT | (uint16_t)font_address, false));
	return font;
}

Color lcd_set_forecolor(Color color)
{
	while (!mb_push_evt(EVT_FORECOLOR|(uint16_t)color,false)) ;
	return color;
}

Color lcd_set_background(DC *dc, Color color)
{
	return color;
}

uint32_t lcd_set_alignment(DC *dc, uint32_t alignment)
{
	while (!mb_push_evt(EVT_SETALIGNMENT | (uint16_t) alignment , false)) ;
	return alignment;
}

uint32_t lcd_set_direction(DC *dc, uint32_t direction)
{
	while (!mb_push_evt(EVT_SETDIRECTION | (uint16_t) direction , false)) ;
	return direction;
}

/* graphic drawing functions */
void lcd_clear_screen(uint16_t color)
{

}

void lcd_draw_point(uint16_t x, uint16_t y, Color c)
{

}

void lcd_draw_line(int16_t x1, int16_t y1, int16_t x2, int16_t y2, Color c)
{
	shdata[0].x = x1;
	shdata[0].y = y1;
	shdata[1].x = x2;
	shdata[1].y = y2;

	while (!mb_push_evt(EVT_DRAWLINE | (uint16_t) c, false)) ;
	while (!handshake()) {}
}

void lcd_draw_rect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, Color c)
{
	shdata[0].x = x;
	shdata[0].y = y;
	shdata[1].x = w;
	shdata[1].y = h;
	while (!mb_push_evt(EVT_DRAWRECT | (uint16_t) c , false)) ;
	while (!handshake()) {}
}

void lcd_draw_round_rect(int16_t x, int16_t y, int16_t w, int16_t h, int16_t r, Color c)
{

}

void lcd_draw_circle(int16_t x0, int16_t y0, int16_t r, Color c)
{

}

void lcd_draw_ellipse(Rect r, Color c, int lwidth)
{

}

void lcd_draw_segments(SPoint *p, int n, Color c)
{
	if (n<MAXPOINTS) {
		while (!mb_push_evt(EVT_DRAWSEGMENTS|((uint16_t)n&0x7FF),false)) ;
		while (!handshake()) {}
	}
}

void lcd_draw_lines(SPoint *p, int n)
{
	if (n<MAXPOINTS) {
		while (!mb_push_evt(EVT_DRAWLINES|((uint16_t)n&0x7FF),false)) ;
		while (!handshake()) {}
	}
}

void lcd_draw_path2d(Graph *g, SPoint *p, int n)
{
	if (n>=2){
		int startX = p[0].x;
		int startY = p[0].y;

	for (int i = 1; i < n; ++i){
		int endX = p[i].x;
		int endY = p[i].y;

		lcd_draw_line(startX, startY, endX, endY, g->color);
		startX = endX;
		startY = endY;
	}
}
	else{
		return;
	}

}


void lcd_fill_rect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
	shdata[0].x = x;
	shdata[0].y = y;
	shdata[1].x = w;
	shdata[1].y = h;

	while (!mb_push_evt(EVT_FILLRECT|((uint16_t)color), false));
	while (!handshake()) {}
}

/* draw lines with clipping */
void lcd_clip(int x1, int y1, int x2, int y2)
{
	shdata[0].x = x1;
	shdata[0].y = y1;
	shdata[1].x = x2;
	shdata[1].y = y2;

	while (!mb_push_evt(EVT_CLIP, false));
	while (!handshake()) {}
}

void lcd_unclip(void)
{
	while (!mb_push_evt(EVT_UNCLIP, false));
}

void lcd_line(int x1, int y1, int x2, int y2, Color c)
{

}

/* String drawing functions */
uint16_t lcd_draw_char(DC *dc, int16_t x, int16_t y, char c)
{
	return 0;
}

void lcd_draw_string(DC *dc, int16_t x, int16_t y, const char *s)
{
	int length=strlen(s);
		int dataIndex = 1;
		shdata[0].x = x;
		shdata[0].y = y;
		for(int i=0; i<length; i+=2){
			shdata[dataIndex].x = s[i];
			shdata[dataIndex].y = (i+1<length) ? s[i+1] : 0;
			dataIndex++;
		}
		while (!mb_push_evt(EVT_DRAWSTRING|(uint32_t)length, false));
		while (!handshake()) {}
}

void lcd_get_string_size(DC *dc, const char *s, uint16_t *width, uint16_t *height)
{

}

void lcd_flush(void)
{

}
#endif

#define TICKSIZE		5
#define SUBTICKSIZE		3

void g_xgrid(Graph *g, header *xticks, real factor, unsigned int color)
{
	real *ticks=matrixof(xticks);
	int n=dimsof(xticks)->c;
	DC dc;
	
	lcd_get_default_DC(&dc);
	lcd_set_alignment(&dc,ALIGN_S);
	
	if (!(g->flags & G_XLOG)) {
		g->xfactor = (real)(g->pxmax - g->pxmin) / (g->xmax - g->xmin);
		for (int i=0 ; i<n ; i++) {
			shdata[2*i].x = (short)(g->pxmin + (ticks[i] - g->xmin) * g->xfactor);
			shdata[2*i].y = g->pymin;
			shdata[2*i+1].x = shdata[2*i].x;
			shdata[2*i+1].y = g->pymax;
		}
		
		if (g->flags & G_XGRID) {	/* draw the grid */
			lcd_draw_segments(shdata,n,gridcolor);
		}
				
		for (int i=0 ; i<n ; i++) {
			shdata[2*i+1].y = g->pymin+TICKSIZE;
		}
		lcd_draw_segments(shdata,n,BLACK);
		
		for (int i=0 ; i<n ; i++) {
			char s[32];
			snprintf(s,32,"%g",fabs(ticks[i]/factor) < 1e-6 ? 0.0 : ticks[i]/factor);
			shdata[2*i+1].y = g->pymax;
			shdata[2*i].y = shdata[2*i+1].y-TICKSIZE;
			lcd_draw_string(&dc,shdata[2*i+1].x,shdata[2*i+1].y+fixed12.height/2,s);
		}
		lcd_draw_segments(shdata,n,BLACK);
		
		if (factor!=1.0) {
			char s[32];
			snprintf(s,32,"x%g", factor);
			lcd_set_alignment(&dc,ALIGN_SW);
			lcd_draw_string(&dc,g->pxmax+fixed12.width,g->pymax+2*fixed12.height,s);
		}
	} else {
		g->xfactor = (real)(g->pxmax - g->pxmin) / log10(g->xmax / g->xmin);
		for (int i=0 ; i<n ; i++) {
			shdata[2*i].x = (short)(g->pxmin + g->xfactor*log10(ticks[i]/g->xmin));
			shdata[2*i].y = g->pymin;
			shdata[2*i+1].x = shdata[2*i].x;
			shdata[2*i+1].y = g->pymax;
		}
		
		if (g->flags & G_XGRID) {
			lcd_draw_segments(shdata,n,gridcolor);
		}
				
		for (int i=0 ; i<n ; i++) {
			real d = ticks[i]/pow(10.0,floor(log10(ticks[i])));
			if (d!=1.0) {
				shdata[2*i+1].y = g->pymin+SUBTICKSIZE;
			} else {
				shdata[2*i+1].y = g->pymin+TICKSIZE;
			}
		}
		lcd_draw_segments(shdata,n,BLACK);
		
		for (int i=0 ; i<n ; i++) {
			char s[32];
			shdata[2*i+1].y = g->pymax;
			
			real e = floor(log10(ticks[i]));
			real d = ticks[i]/pow(10.0,e);
			if (d!=1.0) {
				shdata[2*i].y = shdata[2*i+1].y-SUBTICKSIZE;
			} else {
				shdata[2*i].y = shdata[2*i+1].y-TICKSIZE;
				snprintf(s,32,"%g", e);
				lcd_set_font(&dc,&fixed12);
				lcd_set_alignment(&dc,ALIGN_S);
				lcd_draw_string(&dc,shdata[2*i+1].x,shdata[2*i+1].y+3*fixed12.height/4,"10");
				lcd_set_font(&dc,&fixed8);
				lcd_set_alignment(&dc,ALIGN_E);
				lcd_draw_string(&dc,shdata[2*i+1].x+fixed12.width,shdata[2*i+1].y+3*fixed12.height/4,s);
			}
		}
		lcd_draw_segments(shdata,n,BLACK);
	}
}

void g_ygrid(Graph *g, header *yticks, real factor, unsigned int color)
{
	real *ticks=matrixof(yticks);
	int n=dimsof(yticks)->c;
	DC dc;
	
	lcd_get_default_DC(&dc);
	lcd_set_alignment(&dc,ALIGN_W);
	
	if (!(g->flags & G_YLOG)) {
		g->yfactor = (real)(g->pymax - g->pymin) / (g->ymax - g->ymin);
		for (int i=0 ; i<n ; i++) {
			shdata[2*i].x = g->pxmin;
			shdata[2*i].y = g->pymax - g->yfactor*(ticks[i]-g->ymin);
			shdata[2*i+1].x = g->pxmax;
			shdata[2*i+1].y = shdata[2*i].y;
		}
		
		if (g->flags & G_YGRID) {	/* draw the grid */
			lcd_draw_segments(shdata,n,gridcolor);
		}
		
