omarabedk/CM33/lpc55s69_calc_starter_master/source/sysdep.c
		for (int i=0 ; i<n ; i++) {
			char s[32];
			snprintf(s,32,"%g",fabs(ticks[i]/factor) < 1e-6 ? 0.0 : ticks[i]/factor);
			shdata[2*i+1].x = g->pxmin+TICKSIZE;
			lcd_draw_string(&dc,shdata[2*i].x-fixed12.width/2,shdata[2*i].y,s);
		}
		lcd_draw_segments(shdata,n,BLACK);
		
		for (int i=0 ; i<n ; i++) {
			shdata[2*i+1].x = g->pxmax;
			shdata[2*i].x = shdata[2*i+1].x-TICKSIZE;
		}
		
		lcd_draw_segments(shdata,n,BLACK);
		
		if (factor!=1.0) {
			char s[32];
			snprintf(s,32,"x%g", factor);
			lcd_set_alignment(&dc,ALIGN_SE);
			lcd_draw_string(&dc,g->pxmin-5*fixed12.width,g->pymin-fixed12.height,s);
		}
		
	} else {
		g->yfactor = (real)(g->pymax - g->pymin) / log10(g->ymax / g->ymin);
		for (int i=0 ; i<n ; i++) {
			shdata[2*i].x = g->pxmin;
			shdata[2*i].y = g->pymax - g->yfactor*log10(ticks[i]/g->ymin);
			shdata[2*i+1].x = g->pxmax;
			shdata[2*i+1].y = shdata[2*i].y;
		}
		
		if (g->flags & G_YGRID) {
			lcd_draw_segments(shdata,n,gridcolor);
		}
		
		for (int i=0 ; i<n ; i++) {
			char s[32];
			real e = floor(log10(ticks[i]));
			real d = ticks[i]/pow(10.0,e);
			if (d!=1.0) {
				shdata[2*i+1].x = g->pxmin+SUBTICKSIZE;
			} else {
				shdata[2*i+1].x = g->pxmin+TICKSIZE;
				int len = snprintf(s,32,"%g", e);
				lcd_set_font(&dc,&fixed12);
				lcd_set_alignment(&dc,ALIGN_W);
				lcd_draw_string(&dc,shdata[2*i].x-fixed12.width/2-len*fixed8.width,shdata[2*i].y,"10");
				lcd_set_font(&dc,&fixed8);
				lcd_set_alignment(&dc,ALIGN_E);
				lcd_draw_string(&dc,shdata[2*i].x-fixed12.width/2-len*fixed8.width,shdata[2*i].y-fixed12.height/2,s);
			}
		}
		lcd_draw_segments(shdata,n,BLACK);
		
		for (int i=0 ; i<n ; i++) {
			shdata[2*i+1].x = g->pxmax;
			real d = ticks[i]/pow(10.0,floor(log10(ticks[i])));
			if (d!=1.0) {
				shdata[2*i].x = shdata[2*i+1].x-SUBTICKSIZE;
			} else {
				shdata[2*i].x = shdata[2*i+1].x-TICKSIZE;
			}
		}
		lcd_draw_segments(shdata,n,BLACK);
	}
}

static void g_draw_path2d(Graph *g, SPoint *curve, int n, Color c)
{
	short x0, x1, y0, y1;
	switch (g->ltype) {
	case L_SOLID:
		lcd_set_forecolor(gcolors[c]);
		lcd_draw_lines(curve,n);
		break;
	case L_DOTTED:
	case L_DASHED:
		x0=curve[0].x; y0=curve[0].y;
		for (int i=1;i<n;i++) {
			x1=curve[i].x; y1=curve[i].y;
			lcd_line(x0,y0,x1,y1,gcolors[c]);
			x0=x1; y0=y1;
		}
		break;
	case L_COMB:
		for (int i=0;i<n;i++) {
			lcd_line(curve[i].x,g->pyorg,curve[i].x,curve[i].y,gcolors[c]);
		}
		break;
	case L_ARROW:
#if 0
		for (int i=1;i<n;i++) {
			real c1=(real)curve[i-1].x, r1=(real)curve[i-1].y;
			real c2=(real)curve[i].x, r2=(real)curve[i].y;
			real dx = c2 - c1;
			real dy = r2 - r1;
			real norme = sqrt(dx*dx+dy*dy);
			real cs = dx/norme;
			real sn = dy/norme;
			real a = 0.3*norme;
			real b = 0.6*a;
			short x0 = (short)(-a*cs - b*sn + c2);
			short y0 = (short)(-a*sn + b*cs + r2);
			short x1 = curve[i].x;
			short y1 = curve[i].y;
			short x2 = (short)(-a*cs + b*sn + c2);
			short y2 = (short)(-a*sn - b*cs + r2);
		}
#endif
		break;
	case L_BAR:
		for (int i=0;i<n-1;i++) {
			if (curve[i].y>=g->pyorg) {
				lcd_draw_rect(curve[i].x,g->pyorg,curve[i+1].x-curve[i].x+1,curve[i].y-g->pyorg+1,gcolors[c]);
			} else {
				lcd_draw_rect(curve[i].x,curve[i].y,curve[i+1].x-curve[i].x+1,g->pyorg-curve[i].y+1,gcolors[c]);
			}
		}
		break;
	case L_FBAR:
		for (int i=0;i<n-1;i++) {
			if (curve[i].y>=g->pyorg) {
				lcd_fill_rect(curve[i].x,g->pyorg,curve[i+1].x-curve[i].x-1,curve[i].y-g->pyorg+1,gcolors[c]);
			} else {
				lcd_fill_rect(curve[i].x,curve[i].y,curve[i+1].x-curve[i].x-1,g->pyorg-curve[i].y+1,gcolors[c]);
			}
		}
		break;
	case L_STEP:
		for (int i=0; i<n-1; i++) {
			lcd_line(curve[i].x,curve[i].y,curve[i+1].x,curve[i].y,gcolors[c]);
			lcd_line(curve[i+1].x,curve[i].y,curve[i+1].x,curve[i+1].y,gcolors[c]);
		}
		break;
	case L_FSTEP:
		for (int i=0;i<n-1;i++) {
			if (curve[i].y>=g->pyorg) {
				lcd_fill_rect(curve[i].x,g->pyorg,curve[i+1].x-curve[i].x,curve[i].y-g->pyorg+1,gcolors[c]);
			} else {
				lcd_fill_rect(curve[i].x,curve[i].y,curve[i+1].x-curve[i].x,g->pyorg-curve[i].y+1,gcolors[c]);
			}
		}
		break;
	case L_NONE:
	default:
		break;
	}

	if (g->mtype!=M_NONE) {
		if (g->mtype==M_DOT) {
			for (int i=0;i<n;i++) {
				if (curve[i].x>g->pxmin && curve[i].x<g->pxmax && curve[i].y>g->pymin && curve[i].y<g->pymax) {
					lcd_draw_point(curve[i].x,curve[i].y,gcolors[c]);
				}
			}
		} else {
			for (int i=0;i<n;i++) {
				if (curve[i].x>g->pxmin && curve[i].x<g->pxmax && curve[i].y>g->pymin && curve[i].y<g->pymax) {
					switch (g->mtype) {
					case M_CROSS: {
						lcd_draw_line(curve[i].x-g->msize/2,curve[i].y-g->msize/2,curve[i].x+g->msize/2,curve[i].y+g->msize/2,gcolors[c]);
						lcd_draw_line(curve[i].x-g->msize/2,curve[i].y+g->msize/2,curve[i].x+g->msize/2,curve[i].y-g->msize/2,gcolors[c]);
						break;
					}
					case M_PLUS: {
						lcd_draw_line(curve[i].x-g->msize/2,curve[i].y,curve[i].x+g->msize/2,curve[i].y,gcolors[c]);
						lcd_draw_line(curve[i].x,curve[i].y+g->msize/2,curve[i].x,curve[i].y-g->msize/2,gcolors[c]);
						break;
					}
					case M_STAR: {
						short d1=g->msize/2*239/338;			// d->msize/2*0.707
						short d2=(g->msize/2+1)*239/338;		// d->msize/2*0.707
						lcd_draw_line(curve[i].x-g->msize/2,curve[i].y,curve[i].x+g->msize/2,curve[i].y,gcolors[c]);
						lcd_draw_line(curve[i].x,curve[i].y+g->msize/2,curve[i].x,curve[i].y+g->msize/2,gcolors[c]);
						lcd_draw_line(curve[i].x-d1,curve[i].y-d1,curve[i].x+d2,curve[i].y+d2,gcolors[c]);
						lcd_draw_line(curve[i].x-d1,curve[i].y+d1,curve[i].x+d2,curve[i].y-d2,gcolors[c]);
						break;
					}
					case M_SQUARE:
						lcd_draw_rect(curve[i].x-g->msize/2,curve[i].y-g->msize/2,g->msize,g->msize,gcolors[c]);
						break;
					case M_FSQUARE:
						lcd_fill_rect(curve[i].x-g->msize/2,curve[i].y-g->msize/2,g->msize,g->msize,gcolors[c]);
						break;
					case M_DOT:
					case M_FCIRCLE:
					case M_CIRCLE:
						lcd_draw_circle(curve[i].x,curve[i].y,g->msize/2,gcolors[c]);
						break;
					case M_DIAMOND:
					case M_FDIAMOND:
						lcd_draw_line(curve[i].x-g->msize/2,curve[i].y,curve[i].x,curve[i].y-g->msize/2,gcolors[c]);
						lcd_draw_line(curve[i].x,curve[i].y-g->msize/2,curve[i].x+g->msize/2,curve[i].y,gcolors[c]);
						lcd_draw_line(curve[i].x+g->msize/2,curve[i].y,curve[i].x,curve[i].y+g->msize/2,gcolors[c]);
						lcd_draw_line(curve[i].x,curve[i].y+g->msize/2,curve[i].x-g->msize/2,curve[i].y,gcolors[c]);
						break;
					case M_ARROW:
						lcd_draw_line(curve[i].x,curve[i].y,curve[i].x+g->msize*13/38,curve[i].y-g->msize,gcolors[c]);
						lcd_draw_line(curve[i].x+g->msize*13/38,curve[i].y-g->msize,curve[i].x-g->msize*13/38,curve[i].y-g->msize,gcolors[c]);
						lcd_draw_line(curve[i].x-g->msize*13/38,curve[i].y-g->msize,curve[i].x,curve[i].y,gcolors[c]);
						break;
					case M_TRIANGLE:
					case M_FTRIANGLE:
						lcd_draw_line(curve[i].x,curve[i].y+g->msize/2,curve[i].x+g->msize/2,curve[i].y-g->msize/2,gcolors[c]);
						lcd_draw_line(curve[i].x+g->msize/2,curve[i].y-g->msize/2,curve[i].x-g->msize/2,curve[i].y-g->msize/2,gcolors[c]);
						lcd_draw_line(curve[i].x-g->msize/2,curve[i].y-g->msize/2,curve[i].x,curve[i].y+g->msize/2,gcolors[c]);
						break;
					default:
						break;
					}
				}
			}
		}
	}
}

