omarabedk/CM33/lpc55s69_calc_starter_master/source/sysdep.c
static int g_draw_plot(Graph *g, header *hdx, header *hdy)
{
	real *x, *y;
	int rx, ry, cx, cy;
	
	getmatrix(hdx,&rx,&cx,&x); getmatrix(hdy,&ry,&cy,&y);
	
	// no more than MAXPOINTS allowed
	if (cx>MAXPOINTS) cc_error(calc,"Too many points to draw");

	// clip frame
	lcd_clip(g->pxmin,g->pymin,g->pxmax,g->pymax);
	
	// precalculate the x value for the first line
	if (!(g->flags & G_XLOG)) {
		for (int i=0 ; i<cx ; i++) {
			shdata[i].x = (short)(g->pxmin + (x[i] - g->xmin) * g->xfactor);
		}
	} else {
		for (int i=0 ; i<cx ; i++) {
			shdata[i].x = (short)(g->pxmin + log10(x[i] / g->xmin) * g->xfactor);
		}
	}
	
	if (!(g->flags & G_YLOG)) {
		for (int k=0; k<ry; k++) {
			// if the x matrix has several lines, process x matrix 1 line at a time
			if (k && rx>1) {
				x+=cx;
				if (!(g->flags & G_XLOG)) {
					for (int i=0 ; i<cx ; i++) {
						shdata[i].x = (short)(g->pxmin + (x[i] - g->xmin) * g->xfactor);
					}
				} else {
					for (int i=0 ; i<cx ; i++) {
						shdata[i].x = (short)(g->pxmin + log10(x[i] / g->xmin) * g->xfactor);
					}
				}
			}
			// process y matrix 1 line at a time
			for (int i=0 ; i<cx ; i++) {
				if (y[i]>g->ymax)			/* avoid int16 overflow */
					shdata[i].y = g->pymin - 5;
				else if (y[i]<g->ymin)		/* avoid int16 overflow */
					shdata[i].y = g->pymax + 5;
				else						/* calculate standard case */
					shdata[i].y = (short)(g->pymin + (g->ymax - y[i]) * g->yfactor);
			}
			g_draw_path2d(g,shdata,cx,g->color);
			y+=cy;
			if (g->flags & G_AUTOCOLOR) {
				g->color=(g->color+1) % MAX_COLORS;
			}
			if (g->mtype!=M_NONE)
				g->mtype=(g->mtype+1) % (M_NONE-1);
			
			if (sys_test_key()==escape) break;
		}
	} else {
		// G_YLOG
		for (int k=0; k<ry; k++) {
			// if the x matrix has several lines, process x matrix 1 line at a time
			if (k && rx>1) {
				x+=cx;
				if (!(g->flags & G_XLOG)) {
					for (int i=0 ; i<cx ; i++) {
						shdata[i].x = (short)(g->pxmin + (x[i] - g->xmin) * g->xfactor);
					}
				} else {
					for (int i=0 ; i<cx ; i++) {
						shdata[i].x = (short)(g->pxmin + log10(x[i] / g->xmin) * g->xfactor);
					}
				}
			}
			for (int i=0 ; i<cx ; i++) {
				shdata[i].y = (short)(g->pymax - log10(y[i] /g->ymin) * g->yfactor);
			}
			g_draw_path2d(g,shdata,cx,g->color);
			y+=cy;
			if (g->flags & G_AUTOCOLOR) {
				g->color=(g->color+1) % MAX_COLORS;
			}
			if (g->mtype!=M_NONE) {
				g->mtype=(g->mtype+1) % (M_NONE-1);
			}
			
			if (sys_test_key()==escape) break;
		}
	}
	lcd_unclip();
	
	return ry;
}

void graphic_mode ()
/***** graphic_mode
 * switch to graphic mode
 *****/
{
}

void gsubplot(int r, int c, int i);

static void gupdate(Graph *g)
{
	// update g->pxorg and g->pyorg
	if (!(g->flags & G_XLOG)) {
		g->xfactor = (real)(g->pxmax - g->pxmin) / (g->xmax - g->xmin);
		if (g->xorg>g->xmin && g->xorg<g->xmax) {
			g->pxorg = g->pxmin + (g->xorg - g->xmin)*g->xfactor;
		} else if (g->xorg<=g->xmin) {
			g->pxorg = g->pxmin;
		} else {
			g->pxorg = g->pxmax;
		}
	} else {
		g->xfactor = (real)(g->pxmax - g->pxmin) / log10(g->xmax / g->xmin);
		if (g->xorg>g->xmin && g->xorg<g->xmax) {
			g->pxorg = g->pxmin + log10(g->xorg / g->xmin)*g->xfactor;
		} else if (g->xorg<=g->xmin) {
			g->pxorg = g->pxmin;
		} else {
			g->pxorg = g->pxmax;
		}
	}
	if (!(g->flags & G_YLOG)) {
		g->yfactor = (real)(g->pymax - g->pymin) / (g->ymax - g->ymin);
		if (g->yorg>g->ymin && g->yorg<g->ymax) {
			g->pyorg = g->pymin + (g->ymax - g->yorg) * g->yfactor;
		} else if (g->yorg<=g->ymin) {
			g->pyorg = g->pymax;
		} else {
			g->pyorg = g->pymin;
		}
	} else {
		g->yfactor = (real)(g->pymax - g->pymin) / log10(g->ymax / g->ymin);
		if (g->yorg>g->ymin && g->yorg<g->ymax) {
			g->pyorg = g->pymax - log10(g->yorg /g->ymin) * g->yfactor;
		} else if (g->yorg<=g->ymin) {
			g->pyorg = g->pymax;
		} else {
			g->pyorg = g->pymin;
		}
	}
}

static int ginit(GraphWindow *gw)
{
	gw->pch=fixed12.height;
	gw->pcw=fixed12.width;

	gw->cur=0;
	gw->n=1;
	gw->rows=1;
	gw->cols=1;
	
	gsubplot(1,1,1);
	return true;
}

/* subplot callback
 * r:nb of rows, c:nb of columns, i: index of the current graph
 */
void gsubplot(int r, int c, int i)
{
	if (i==1) {
		lcd_clear_screen(WHITE);
		// setup new layout
		gw.rows=r; gw.cols=c; gw.n=r*c;
		int w=LCD_WIDTH,h=LCD_HEIGHT-3*gw.pch;
		for (int k=0; k<gw.n; k++) {
			Graph *g=gw.graph+k;
			g->pxmin=((k)%c)*w/c+6*gw.pcw;
			g->pxmax=(((k)%c)+1)*w/c-2*gw.pcw;
			g->pymin=((k)/c)*h/r+3*gw.pch/2;
			g->pymax=(((k)/c)+1)*h/r-3*gw.pch/2;
			g->xorg=0.0; g->yorg=0.0;
			g->xmin=-1.0; g->xmax=1.0; g->ymin=-1.0; g->ymax=1.0;
			g->flags=G_WORLDUNSET|G_AXISUNSET|G_AUTOSCALE;
			g->flags|=(M_NONE<<20)|(1<<28);
			g->color=0;
			g->ltype=L_SOLID;
			g->lwidth=1;
			g->mtype=M_NONE;
		}
	} else if (gw.rows!=r || gw.cols!=c) cc_error(calc,"Plot layout changed, but index not 1");
	gw.cur=i-1;
	Graph *g=gw.graph+gw.cur;
	int w=LCD_WIDTH,h=LCD_HEIGHT-3*gw.pch;
	// subplot may have been called before, so cleanup if it has.
	g->pxmin=((i-1)%c)*w/c+6*gw.pcw;
	g->pxmax=(((i-1)%c)+1)*w/c-2*gw.pcw;
	g->pymin=((i-1)/c)*h/r+3*gw.pch/2;
	g->pymax=(((i-1)/c)+1)*h/r-3*gw.pch/2;
	g->xorg=0.0; g->yorg=0.0;
	g->xmin=-1.0; g->xmax=1.0; g->ymin=-1.0; g->ymax=1.0;
	g->flags=G_WORLDUNSET|G_AXISUNSET|G_AUTOSCALE;
	g->flags|=(M_NONE<<20)|(1<<28);
	g->color=0;
	g->ltype=L_SOLID;
	g->lwidth=1;
	g->mtype=M_NONE;
}

/* setplot callback:
 * setup the limits of the plot (xmin,xmax,ymin,ymax), and flags.
 */
void gsetplot(real xmin, real xmax, real ymin, real ymax, unsigned long flags, unsigned long mask)
{
	if (gw.n) {
		Graph *g=gw.graph+gw.cur;
		// update flags
		g->flags=(g->flags & ~mask) | flags;
		if (mask & G_LTYPE_MSK) g->ltype=(flags & G_LTYPE_MSK)>>16;
		if (mask & G_MTYPE_MSK) g->mtype=(flags & G_MTYPE_MSK)>>20;
		if (mask & G_COLOR_MSK) g->color=(flags & G_COLOR_MSK)>>24;
		if (mask & G_LWIDTH_MSK) g->lwidth=(flags & G_LWIDTH_MSK)>>28;
		
		if (g->xmin!=xmin || g->xmax!=xmax || g->ymin!=ymin || g->ymax!=ymax) {
			if (g->flags & G_WORLDUNSET) {
				g->xmin=xmin; g->xmax=xmax; g->ymin=ymin; g->ymax=ymax;
				g->flags &= ~G_WORLDUNSET;
			} else if (g->flags & G_AUTOSCALE) {
				g->xmin=(xmin<g->xmin) ? xmin : g->xmin;
				g->xmax=(xmax>g->xmax) ? xmax : g->xmax;
				g->ymin=(ymin<g->ymin) ? ymin : g->ymin;
				g->ymax=(ymax>g->ymax) ? ymax : g->ymax;
			} else {
				g->xmin=xmin; g->xmax=xmax; g->ymin=ymin; g->ymax=ymax;
			}
		}
		
		if ((g->flags & G_XLOG) && g->xorg<=0.0) g->xorg=1.0;
		if ((g->flags & G_YLOG) && g->yorg<=0.0) g->yorg=1.0;
		gupdate(g);
		if (g->flags & G_AXIS) {
			lcd_draw_line(g->pxmin,g->pyorg,g->pxmax,g->pyorg,gridcolor);
			lcd_draw_line(g->pxorg,g->pymin,g->pxorg,g->pymax,gridcolor);
		}
		if (g->flags & G_FRAME) {
			lcd_draw_rect(g->pxmin,g->pymin,g->pxmax-g->pxmin+1,g->pymax-g->pymin+1,BLACK);
		}
	}
}

